/******************************************************
程序功能：接收来自PC机的字符，然后重新发送给PC机
-------------------------------------------------------
通信格式：N.8.1,  9600
         无校验，8个数据位，1个停止位，波特率9600
------------------------------------------------------
测试说明：打开串口调试助手，正确设置通信格式，向学习板
          发送一个字符，观察是否收到回发的字符，以及是否
          正确
*******************************************************/
#include  <msp430x14x.h>
#include  "BoardConfig.h"

/********************主函数********************/
void main(void)
{
    WDTCTL = WDTPW + WDTHOLD;                 // 关闭看门狗
    BoardConfig(0xb8);                        // 关闭数码管、流水灯和电平转换
    
    P3SEL |= 0x30;                            // 选择P3.4和P3.5做UART通信端口
    ME1 |= UTXE0 + URXE0;                     // 使能USART0的发送和接受
    UCTL0 |= CHAR;                            // 选择8位字符
    UTCTL0 |= SSEL0;                          // UCLK = ACLK
    UBR00 = 0x03;                             // 波特率9600
    UBR10 = 0x00;                             //
    UMCTL0 = 0x4A;                            // Modulation
    UCTL0 &= ~SWRST;
    TXBUF0 = 'a';                         // 初始化UART状态机
  //  IE1 |= URXIE0;                            // 使能USART0的接收中断
  //  _EINT();    
    while(1)
    {
        if(IFG1 & URXIFG0)                  // RXBUF0 to TXBUF0
        TXBUF0 = RXBUF0;
    }
}

