/***************************************************************
程序功能：在连接器P7的第9引脚输出PWM波形，其占空比依次为
          25%,50%,75%；每个占空比的波形持续时间5S
----------------------------------------------------------------
跳线设置：将跳线座J4的2脚和3脚用短路帽连接（靠右侧的两个）
----------------------------------------------------------------
测试说明：用示波器观察P7的第9引脚的波形（P7的右侧起是第1引脚）
****************************************************************/
#include  <msp430x14x.h>
#include  "BoardConfig.h"

/**********************主函数****************/
void main(void)
{
  WDTCTL = WDTPW + WDTHOLD;                 // 关狗
  BoardConfig(0x38);                        // 打开电平转换，关闭流水灯和蜂鸣器
  P1DIR |= BIT7;                            // P1.7选择为输出
  P1SEL |= BIT7;                            // P1.7作为TA的OUT2输出
  CCR0 = 128;                               // PWM Period
  CCTL2 = OUTMOD_6;                         // CCR2 toggle/set
  CCR2 = 32;                                // CCR2 PWM duty cycle
  TACTL = TASSEL_1 + MC_3;                  // ACLK, up-down mode
  
  TBCCR0 = 4096*5-1;                        //定时5S
  TBCTL = TBSSEL_1 + ID_3 + MC_1;           // 时钟源ACLK/8
  _BIS_SR(LPM3_bits);                       // Enter LPM3
}

/*******************************************
函数名称：Timer_B
功    能：定时器B的中断服务函数，在这里更改
          PWM的占空比
参    数：无
返回值  ：无
********************************************/
#pragma vector=TIMERB0_VECTOR
__interrupt void Timer_B(void)
{
  CCR2 += 32;
  if(CCR2 == 128)   CCR2 = 32;
}
