/***************************************************************
程序功能：在12864液晶上显示两幅图片,一个为阴码图片，一个为阳码
          图片
---------------------------------------------------------------
测试说明：观察液晶显示
**************************************************************/
#include  "msp430.h"
#include  "BoardConfig.h"
#include  "cry12864.h"
#include  "qq.h"


/*************************主函数*************************/
void main( void )
{

    WDTCTL = WDTPW + WDTHOLD;       //关狗
    BoardConfig(0xbe);
    
    Ini_Lcd();
    Clear_GDRAM();
    
    Draw_PM(qq1);
    
    _NOP();             //在这里设置断点观察液晶屏幕显示
   
    Draw_PM(qq2);
    
    LPM4;
}
