/*********************************************************
程序功能：在PC机上用串口调试精灵对DS1302进行设置时间和读取
           时间的操作
-----------------------------------------------------------
通信格式：N.8.1,  9600
-----------------------------------------------------------
测试说明：打开串口调试助手，正确设置通信格式，根据菜单提示
          发送字符进行测试。注意：在对DS1302的时间进行设置
          时在用串口调试精灵发送数据前必须先选中左侧的“16
          进制发送”一项，然后再发送数据才能正确的设置
          DS1302的内部时间，设置完毕后必须勾掉这一项，然后
          才能再发送菜单提示的字符进行串口通信控制
**********************************************************/
#include <msp430.h>
#include "BoardConfig.h"
#include "uart0.h"
#include "DS1302.h"

uchar step = 0xff;

/**************************主函数**************************/
void main( void )
{
    uchar i;
    
    WDTCTL = WDTPW + WDTHOLD;           //关狗
    BoardConfig(0xb8);                  //关数码管，流水灯和电平转换
    
    InitUART();                         //初始化UART端口
    
    Reset_DS1302();                     //初始化DS1302
    
    DisplayConfigMenu();
    while(1)
    {
        Send1Char('>');
        Send1Char('\n');
        i=Get1Char();
        HandleConfigMenu(i);
    }
    
}
