/***************************************************
程序功能：用串行数据通信方式显示两个图片
----------------------------------------------------
跳线设置：将跳线座J5的2脚和3脚(-)用短路帽短接
----------------------------------------------------
测试说明：观察液晶显示
****************************************************/
#include  <msp430x14x.h>
#include "BoardConfig.h"
#include "cryfucns.h"
#include "monkey.h"

/****************主函数****************/
void main(void)
{    
    WDTCTL = WDTPW + WDTHOLD;            //关闭看门狗
    BoardConfig(0xb8);                   //关闭数码管、流水灯、4245
    
    Ini_Lcd();
    Clear_GDRAM();
    
    Draw_PM(monkey1);                    //显示阴码格式的猴子画面             
    
    _NOP();                              //设置断点观察
    
    Draw_PM(monkey2);                    //显示阳码格式的猴子画面               
    
    LPM4;
}
