/***********************************************************
程序功能：通过74LVC4245在连接器P2的引脚上产生5v
          电平的百分之五十占空比的方波。
------------------------------------------------------------
跳线设置：将跳线座J4的3脚和2脚（靠左侧的两个）用短路帽连接
------------------------------------------------------------
测试说明：用户可以通过示波器观察连接器P7的2--9脚输出的信号波
          形和幅值。
************************************************************/
#include  <msp430x14x.h>
#include  "BoardConfig.h"

/********************主函数********************/
void main(void)
{
    WDTCTL = WDTPW + WDTHOLD;       //关闭看门狗
    BoardConfig(0x38);              //关闭数码管、流水灯、打开电平转换
    
    P3DIR |= BIT4;                  //设置P3.4为输出
    P5DIR = 0xff;
    P5OUT = 0x00;
    
    TBCCTL0 = CCIE;                 //允许CCR0比较中断
    TBCCR0 = 50000;
    TBCTL = TBSSEL_2 + MC_2;        //计数时钟SMCLK，连续计数模式

    _EINT();                        //打开全局中断
    LPM0;                           //进入LPM0模式
}
/*******************************************
函数名称：TimerB_ISR
功    能：定时器B的中断服务函数
参    数：无
返回值  ：无
********************************************/
#pragma vector = TIMERB0_VECTOR
__interrupt void TimerB_ISR(void)
{
    P3OUT ^= BIT4;                  //P3.4连接的LED闪烁           
    P5OUT ^= 0xff;                  //P5口输出50%占空比方波         
    TBCCR0 += 50000;                //TBCCR0增加偏置量
}

